import pytest
import pandas as pd

@pytest.fixture
def cashback_and_phone_data():
    """ Фикстура для services.py """
    return pd.DataFrame({
        "Дата операции": [
            "15.10.2025 10:00:00",
            "20.10.2025 10:30:00",
            "10.11.2025 11:00:00",
            "12.12.2025 11:30:00",
        ],
        "Категория": [
            "супермаркеты",
            "ресторан",
            "аптека",
            "кафе"
        ],
        "Сумма платежа": [
            -4000,
            -3000,
            -2000,
            -1000,
        ],
        "Кэшбэк": [
            40.0,
            30.0,
            20.0,
            10.0
        ],
        "Описание": [
            "Оплата с телефона +7 (123) 456-78-90",
            "Оплата с телефона 1234567890",
            "Оплата наличными",
            "Оплата с телефона 17-2865-8654"
        ]
    })

@pytest.fixture
def transactions_data():
    """ Фикстура для reports.py """
    return pd.DataFrame({
        "Дата платежа": [
            "15.10.2025",
            "20.11.2025",
            "10.01.2026",
        ],
        "Категория": [
            "супермаркеты",
            "супермаркеты",
            "супермаркеты",
        ],
        "Сумма платежа": [
            -400,
            -300,
            -300,
        ],
    })


@pytest.fixture()
def main_info_data():
    """ Фикстура для views.py """
    return pd.DataFrame({
        "Дата платежа": [
            "21.12.2021",
            "22.12.2021",
        ],
        "Сумма платежа": [
            -2000,
            -3000
        ],
        "Категория": [
            "Переводы",
            "Покупки"
        ],
        "Описание": [
            "Перевод Кредитная карта. ТП 10.2 RUR",
            "Покупка в магазине"
        ],
        "Номер карты": [
            "1111",
            "2222"
        ],
        "Кэшбэк": [
            20.0,
            30.0
        ]
    })


